// Напишите программу, которая на вход будет принимать два числа и выводить, является ли второе число кратным первому.
// Если число 2 не кратно числу 1, то программа выводит остаток от деления

Console.WriteLine("Напишите ваше первое число: ");
int num_1 = int.Parse(Console.ReadLine()!);

Console.WriteLine("Напишите ваше второе число: ");
int num_2 = int.Parse(Console.ReadLine()!);

if(num_1%num_2 == 0)
{
    Console.WriteLine("Твои числа кратны!");
}
else
{
    Console.WriteLine("Твои числа некратны! Остаток от деления равен " + num_1 % num_2);
}